app/controllers/users_controller.rb

INSERT INTO "users" ("name", "password", "salt") VALUES (?, ?, ?)  [["name", "qwe"], ["password", "b273090d7708701f8b647a0dfdb830b3c8ee14bf1dcc8bb17436cbcb458c42fa"], ["salt", "0.8339219252112464"]]
---
  def confirm_registration
    sign_out
    if (params[:user] != nil)
      @par = params[:user]

      if checkName(@par[:name]) != nil
        respond_to do |format|
          format.html { redirect_to(user_register_path, :notice => "Incorrect name")}
          format.xml { head :ok}
        end
        return
      end

      if check_password_and_confirmation(@par[:password], @par[:password_confirmation])
        @user = create_user(@par[:name], @par[:password])
        @user.prepare_to_save
        if @user.save